---
kind: type
id: T:Autodesk.Revit.DB.ImportOptions3DM
source: html/72310605-e939-bc8c-c790-642da4cc02cb.htm
---
# Autodesk.Revit.DB.ImportOptions3DM

The import options used to import 3DM format files.

## Syntax (C#)
```csharp
public class ImportOptions3DM : BaseImportOptions
```